ArduPilot/ardupilot/modules/ChibiOS/os/hal/ports/STM32/STM32H7xx/hal_lld_type3.h
/*
    ChibiOS - Copyright (C) 2006-2026 Giovanni Di Sirio.

    Licensed under the Apache License, Version 2.0 (the "License");
    you may not use this file except in compliance with the License.
    You may obtain a copy of the License at

        http://www.apache.org/licenses/LICENSE-2.0

    Unless required by applicable law or agreed to in writing, software
    distributed under the License is distributed on an "AS IS" BASIS,
    WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
    See the License for the specific language governing permissions and
    limitations under the License.
*/

/**
 * @file    STM32H7xx/hal_lld_type3.h
 * @brief   STM32H7xx HAL subsystem low level driver header.
 * @pre     This module requires the following macros to be defined in the
 *          @p board.h file:
 *          - STM32_LSECLK.
 *          - STM32_LSEDRV.
 *          - STM32_LSE_BYPASS (optionally).
 *          - STM32_HSECLK.
 *          - STM32_HSE_BYPASS (optionally).
 *          - STM32_VDD (as hundredths of Volt).
 *          .
 *          One of the following macros must also be defined:
 *          - STM32H7A3xx, STM32H7B3xx very high-performance MCUs.
 *          - STM32H7A3xxQ, STM32H7B3xxQ very high-performance MCUs with SMPS.
 *          .
 *
 * @addtogroup HAL
 * @{
 */

#ifndef HAL_LLD_TYPE3_H
#define HAL_LLD_TYPE3_H

#include "stm32_registry.h"

/*===========================================================================*/
/* Driver constants.                                                         */
/*===========================================================================*/

/**
 * @name    Platform identification macros
 * @{
 */
#if defined(STM32H7A3xx)
#define PLATFORM_NAME           "STM32H7A3: M7@280MHz +DSP +FPU +OctoSPI +JPEG +TFTLCD +GRC -Crypto -SMPS"

#elif defined(STM32H7A3xxQ)
#define PLATFORM_NAME           "STM32H7A3: M7@280MHz +DSP +FPU +OctoSPI +JPEG +TFTLCD +GRC -Crypto +SMPS"

#elif defined(STM32H7B3xx)
#define PLATFORM_NAME           "STM32H7B3: M7@280MHz +DSP +FPU +OctoSPI +JPEG +TFTLCD +GRC +Crypto -SMPS"

#elif defined(STM32H7B3xxQ) || defined(__DOXYGEN__)
#define PLATFORM_NAME           "STM32H7B3: M7@280MHz +DSP +FPU +OctoSPI +JPEG +TFTLCD +GRC +Crypto +SMPS"

#else
#error "STM32H7xx device not specified"
#endif
/** @} */

/**
 * @name    Absolute Maximum Ratings
 * @{
 */
/**
 * @brief   Absolute maximum system clock.
 */
#define STM32_SYSCLK_MAX                280000000

/**
 * @brief   Absolute maximum HCLK clock.
 */
#define STM32_HCLK_MAX                  (STM32_SYSCLK_MAX)

/**
 * @brief   Maximum HSE clock frequency.
 */
#define STM32_HSECLK_MAX                50000000

/**
 * @brief   Maximum HSE clock frequency using an external source.
 */
#define STM32_HSECLK_BYP_MAX            50000000

/**
 * @brief   Minimum HSE clock frequency.
 */
#define STM32_HSECLK_MIN                4000000

/**
 * @brief   Minimum HSE clock frequency.
 */
#define STM32_HSECLK_BYP_MIN            4000000

/**
 * @brief   Maximum LSE clock frequency.
 */
#define STM32_LSE_CK_MAX                32768

/**
 * @brief   Maximum LSE clock frequency.
 */
#define STM32_LSE_CK_BYP_MAX            1000000

/**
 * @brief   Minimum LSE clock frequency.
 */
#define STM32_LSE_CK_MIN                32768

/**
 * @brief   Minimum PLLs input clock frequency.
 */
#define STM32_PLLIN_MIN                 1000000

/**
 * @brief   PLLs input threshold frequency 1.
 */
#define STM32_PLLIN_THRESHOLD1          2000000

/**
 * @brief   PLLs input threshold frequency 2.
 */
#define STM32_PLLIN_THRESHOLD2          4000000

/**
 * @brief   PLLs input threshold frequency 3.
 */
#define STM32_PLLIN_THRESHOLD3          8000000

/**
 * @brief   Maximum PLLs input clock frequency.
 */
#define STM32_PLLIN_MAX                 16000000

/**
 * @brief   Wide range VCO minimum PLL clock frequency.
 *
 * @note Medium range VCO must be chosen, in case STM32_PLLx_VCO_CK < 2000000; wide range otherwise.
 * @note Medium range VCO is recommended to save power consumption.
 * @note Wide range VCO is chosen after reset.
 */
#define STM32_PLLVCO_WIDE_MIN           128000000

/**
 * @brief   Wide range VCO maximum clock frequency.
 *
 * @note Medium range VCO must be chosen, in case STM32_PLLx_VCO_CK < 2000000; wide range otherwise.
 * @note Medium range VCO is recommended to save power consumption.
 * @note Wide range VCO is chosen after reset.
 */
#define STM32_PLLVCO_WIDE_MAX           560000000

/**
 * @brief   Medium range VCO minimum PLL clock frequency.
 *
 * @note Medium range VCO must be chosen, in case STM32_PLLx_VCO_CK < 2000000; wide range otherwise.
 * @note Medium range VCO is recommended to save power consumption.
 * @note Wide range VCO is chosen after reset.
 */
#define STM32_PLLVCO_MEDIUM_MIN         150000000

/**
 * @brief   Medium range VCO maximum PLL clock frequency.
 *
 * @note Medium range VCO must be chosen, in case STM32_PLLx_VCO_CK < 2000000; wide range otherwise.
 * @note Medium range VCO is recommended to save power consumption.
 * @note Wide range VCO is chosen after reset.
 */
#define STM32_PLLVCO_MEDIUM_MAX         420000000

/**
 * @brief   Maximum APB1 clock frequency.
 */
#define STM32_CDPCLK_MAX                (STM32_HCLK_MAX)

/**
 * @brief   Maximum APB2 clock frequency.
 */
#define STM32_PCLK1_MAX                 (STM32_HCLK_MAX)

/**
 * @brief   Maximum APB3 clock frequency.
 */
#define STM32_PCLK2_MAX                 (STM32_HCLK_MAX)

/**
 * @brief   Maximum APB4 clock frequency.
 */
#define STM32_SRDPCLK_MAX               (STM32_HCLK_MAX)

/**
 * @brief   Maximum SPI1, SPI2 and SPI3 clock frequency.
 */
#define STM32_SPI123_MAX                (STM32_HCLK_MAX)

/**
 * @brief   Maximum SPI4, SPI5 and SPI6 clock frequency.
 */
#define STM32_SPI456_MAX                (STM32_HCLK_MAX)

/**
 * @brief   Maximum ADC clock frequency.
 */
#define STM32_ADCCLK_MAX                50000000
/** @} */

/**
 * @name    Internal clock sources frequencies
 * @{
 */
#define STM32_HSI_OSC                   64000000
#define STM32_HSI48_OSC                 48000000
#define STM32_CSI_OSC                   4000000
#define STM32_LSI_OSC                   32000
/** @} */

/**
 * @name    Register helpers not found in ST headers
 * @{
 */
#define RCC_CR_HSIDIV_VALUE(n)          ((n) << RCC_CR_HSIDIV_Pos)

