ArduPilot/ardupilot/modules/ChibiOS/os/hal/ports/STM32/STM32H7xx/hal_lld_type3.h
#define RCC_CFGR_SW_VALUE(n)            ((n) << RCC_CFGR_SW_Pos)
#define RCC_CFGR_SWS_VALUE(n)           ((n) << RCC_CFGR_SWS_Pos)
#define RCC_CFGR_RTCPRE_VALUE(n)        ((n) << RCC_CFGR_RTCPRE_Pos)
#define RCC_CFGR_MCO1PRE_VALUE(n)       ((n) << RCC_CFGR_MCO1PRE_Pos)
#define RCC_CFGR_MCO1_VALUE(n)          ((n) << RCC_CFGR_MCO1_Pos)
#define RCC_CFGR_MCO2PRE_VALUE(n)       ((n) << RCC_CFGR_MCO2PRE_Pos)
#define RCC_CFGR_MCO2_VALUE(n)          ((n) << RCC_CFGR_MCO2_Pos)

#define RCC_CDCFGR1_CDHPRE_VALUE(n)     ((n) << RCC_CDCFGR1_CDHPRE_Pos)
#define RCC_CDCFGR1_CDCPRE_VALUE(n)     ((n) << RCC_CDCFGR1_CDCPRE_Pos)
#define RCC_CDCFGR1_CDPPRE_VALUE(n)     ((n) << RCC_CDCFGR1_CDPPRE_Pos)

#define RCC_CDCFGR2_CDPPRE1_VALUE(n)    ((n) << RCC_CDCFGR2_CDPPRE1_Pos)
#define RCC_CDCFGR2_CDPPRE2_VALUE(n)    ((n) << RCC_CDCFGR2_CDPPRE2_Pos)

#define RCC_SRDCFGR_SRDPPRE_VALUE(n)    ((n) << RCC_SRDCFGR_SRDPPRE_Pos)

#define RCC_PLLCKSELR_PLLSRC_VALUE(n)   ((n) << RCC_PLLCKSELR_PLLSRC_Pos)

#define RCC_PLLCKSELR_DIVM1_VALUE(n)    ((n) << RCC_PLLCKSELR_DIVM1_Pos)
#define RCC_PLLCKSELR_DIVM2_VALUE(n)    ((n) << RCC_PLLCKSELR_DIVM2_Pos)
#define RCC_PLLCKSELR_DIVM3_VALUE(n)    ((n) << RCC_PLLCKSELR_DIVM3_Pos)

#define RCC_PLL1DIVR_DIVN1_VALUE(n)     ((n) << RCC_PLL1DIVR_N1_Pos)
#define RCC_PLL1DIVR_DIVP1_VALUE(n)     ((n) << RCC_PLL1DIVR_P1_Pos)
#define RCC_PLL1DIVR_DIVQ1_VALUE(n)     ((n) << RCC_PLL1DIVR_Q1_Pos)
#define RCC_PLL1DIVR_DIVR1_VALUE(n)     ((n) << RCC_PLL1DIVR_R1_Pos)

#define RCC_PLL1FRACR_FRACN1_VALUE(n)   ((n) << RCC_PLL1FRACR_FRACN1_Pos)

#define RCC_PLL2DIVR_DIVN2_VALUE(n)     ((n) << RCC_PLL2DIVR_N2_Pos)
#define RCC_PLL2DIVR_DIVP2_VALUE(n)     ((n) << RCC_PLL2DIVR_P2_Pos)
#define RCC_PLL2DIVR_DIVQ2_VALUE(n)     ((n) << RCC_PLL2DIVR_Q2_Pos)
#define RCC_PLL2DIVR_DIVR2_VALUE(n)     ((n) << RCC_PLL2DIVR_R2_Pos)

#define RCC_PLL2FRACR_FRACN2_VALUE(n)   ((n) << RCC_PLL2FRACR_FRACN2_Pos)

#define RCC_PLL3DIVR_DIVN3_VALUE(n)     ((n) << RCC_PLL3DIVR_N3_Pos)
#define RCC_PLL3DIVR_DIVP3_VALUE(n)     ((n) << RCC_PLL3DIVR_P3_Pos)
#define RCC_PLL3DIVR_DIVQ3_VALUE(n)     ((n) << RCC_PLL3DIVR_Q3_Pos)
#define RCC_PLL3DIVR_DIVR3_VALUE(n)     ((n) << RCC_PLL3DIVR_R3_Pos)

#define RCC_PLL3FRACR_FRACN3_VALUE(n)   ((n) << RCC_PLL3FRACR_FRACN3_Pos)

#define RCC_CDCCIPR_CKPERSEL_VALUE(n)   ((n) << RCC_CDCCIPR_CKPERSEL_Pos)
#define RCC_CDCCIPR_SDMMCSEL_VALUE(n)   ((n) << RCC_CDCCIPR_SDMMCSEL_Pos)
#define RCC_CDCCIPR_OCTOSPISEL_VALUE(n) ((n) << RCC_CDCCIPR_OCTOSPISEL_Pos)
#define RCC_CDCCIPR_FMCSEL_VALUE(n)     ((n) << RCC_CDCCIPR_FMCSEL_Pos)

#define RCC_CDCCIP1R_SWPSEL_VALUE(n)    ((n) << RCC_CDCCIP1R_SWPSEL_Pos)
#define RCC_CDCCIP1R_FDCANSEL_VALUE(n)  ((n) << RCC_CDCCIP1R_FDCANSEL_Pos)
#define RCC_CDCCIP1R_DFSDM1SEL_VALUE(n) ((n) << RCC_CDCCIP1R_DFSDM1SEL_Pos)
#define RCC_CDCCIP1R_DFSDM2SEL_VALUE(n) ((n) << RCC_SRDCCIPR_DFSDM2SEL_Pos)
#define RCC_CDCCIP1R_SPDIFSEL_VALUE(n)  ((n) << RCC_CDCCIP1R_SPDIFSEL_Pos)
#define RCC_CDCCIP1R_SPI45SEL_VALUE(n)  ((n) << RCC_CDCCIP1R_SPI45SEL_Pos)
#define RCC_CDCCIP1R_SPI123SEL_VALUE(n) ((n) << RCC_CDCCIP1R_SPI123SEL_Pos)
#define RCC_CDCCIP1R_SAI2BSEL_VALUE(n)  ((n) << RCC_CDCCIP1R_SAI2BSEL_Pos)
#define RCC_CDCCIP1R_SAI2ASEL_VALUE(n)  ((n) << RCC_CDCCIP1R_SAI2ASEL_Pos)
#define RCC_CDCCIP1R_SAI1SEL_VALUE(n)   ((n) << RCC_CDCCIP1R_SAI1SEL_Pos)

#define RCC_CDCCIP2R_LPTIM1SEL_VALUE(n) ((n) << RCC_CDCCIP2R_LPTIM1SEL_Pos)
#define RCC_CDCCIP2R_CECSEL_VALUE(n)    ((n) << RCC_CDCCIP2R_CECSEL_Pos)
#define RCC_CDCCIP2R_USBSEL_VALUE(n)    ((n) << RCC_CDCCIP2R_USBSEL_Pos)
#define RCC_CDCCIP2R_I2C123SEL_VALUE(n) ((n) << RCC_CDCCIP2R_I2C123SEL_Pos)
#define RCC_CDCCIP2R_RNGSEL_VALUE(n)    ((n) << RCC_CDCCIP2R_RNGSEL_Pos)
#define RCC_CDCCIP2R_USART16910SEL_VALUE(n) ((n) << RCC_CDCCIP2R_USART16910SEL_Pos)
#define RCC_CDCCIP2R_USART234578SEL_VALUE(n) ((n) << RCC_CDCCIP2R_USART234578SEL_Pos)

#define RCC_SRDCCIPR_SPI6SEL_VALUE(n)   ((n) << RCC_SRDCCIPR_SPI6SEL_Pos)
#define RCC_SRDCCIPR_ADCSEL_VALUE(n)    ((n) << RCC_SRDCCIPR_ADCSEL_Pos)
#define RCC_SRDCCIPR_LPTIM3SEL_VALUE(n) ((n) << RCC_SRDCCIPR_LPTIM3SEL_Pos)
#define RCC_SRDCCIPR_LPTIM2SEL_VALUE(n) ((n) << RCC_SRDCCIPR_LPTIM2SEL_Pos)
#define RCC_SRDCCIPR_LPTIM1SEL_VALUE(n) ((n) << RCC_SRDCCIPR_LPTIM1SEL_Pos)
#define RCC_SRDCCIPR_I2C4SEL_VALUE(n)   ((n) << RCC_SRDCCIPR_I2C4SEL_Pos)
#define RCC_SRDCCIPR_LPUART1SEL_VALUE(n) ((n) << RCC_SRDCCIPR_LPUART1SEL_Pos)

#define RCC_BDCR_RTCSEL_VALUE(n)        ((n) << RCC_BDCR_RTCSEL_Pos)
/** @} */

/**
 * @name    Configuration switches to be used in @p mcuconf.h
 * @{
 */
#define STM32_VOS_SCALE3                (0U)   /* default */
#define STM32_VOS_SCALE2                (PWR_D3CR_VOS_0)
#define STM32_VOS_SCALE1                (PWR_D3CR_VOS_1)
#define STM32_VOS_SCALE0                (PWR_D3CR_VOS_1 | PWR_D3CR_VOS_0)

#define STM32_SW_HSI_CK                 RCC_CFGR_SW_HSI
#define STM32_SW_CSI_CK                 RCC_CFGR_SW_CSI
#define STM32_SW_HSE_CK                 RCC_CFGR_SW_HSE
#define STM32_SW_PLL1_P_CK              RCC_CFGR_SW_PLL1

#define STM32_CDCPRE_DIV1               (0U)
#define STM32_CDCPRE_DIV2               RCC_CDCFGR1_CDCPRE_DIV2
#define STM32_CDCPRE_DIV4               RCC_CDCFGR1_CDCPRE_DIV4
#define STM32_CDCPRE_DIV8               RCC_CDCFGR1_CDCPRE_DIV8
#define STM32_CDCPRE_DIV16              RCC_CDCFGR1_CDCPRE_DIV16
#define STM32_CDCPRE_DIV64              RCC_CDCFGR1_CDCPRE_DIV64
#define STM32_CDCPRE_DIV128             RCC_CDCFGR1_CDCPRE_DIV128
#define STM32_CDCPRE_DIV256             RCC_CDCFGR1_CDCPRE_DIV256
#define STM32_CDCPRE_DIV512             RCC_CDCFGR1_CDCPRE_DIV512

#define STM32_CDHPRE_DIV1               (0U)
#define STM32_CDHPRE_DIV2               RCC_CDCFGR1_HPRE_DIV2
#define STM32_CDHPRE_DIV4               RCC_CDCFGR1_HPRE_DIV4
#define STM32_CDHPRE_DIV8               RCC_CDCFGR1_HPRE_DIV8
#define STM32_CDHPRE_DIV16              RCC_CDCFGR1_HPRE_DIV16
#define STM32_CDHPRE_DIV64              RCC_CDCFGR1_HPRE_DIV64
#define STM32_CDHPRE_DIV128             RCC_CDCFGR1_HPRE_DIV128
#define STM32_CDHPRE_DIV256             RCC_CDCFGR1_HPRE_DIV256
#define STM32_CDHPRE_DIV512             RCC_CDCFGR1_HPRE_DIV512

