ArduPilot/ardupilot/modules/ChibiOS/os/hal/ports/STM32/STM32H7xx/hal_lld_type3.h
#define STM32_CDPPRE_DIV1               (0U)
#define STM32_CDPPRE_DIV2               RCC_CDCFGR1_CDPPRE_DIV2
#define STM32_CDPPRE_DIV4               RCC_CDCFGR1_CDPPRE_DIV4
#define STM32_CDPPRE_DIV8               RCC_CDCFGR1_CDPPRE_DIV8
#define STM32_CDPPRE_DIV16              RCC_CDCFGR1_CDPPRE_DIV16

#define STM32_CDPPRE1_DIV1              (0U)
#define STM32_CDPPRE1_DIV2              RCC_CDCFGR2_CDPPRE1_DIV2
#define STM32_CDPPRE1_DIV4              RCC_CDCFGR2_CDPPRE1_DIV4
#define STM32_CDPPRE1_DIV8              RCC_CDCFGR2_CDPPRE1_DIV8
#define STM32_CDPPRE1_DIV16             RCC_CDCFGR2_CDPPRE1_DIV16

#define STM32_CDPPRE2_DIV1              (0U)
#define STM32_CDPPRE2_DIV2              RCC_CDCFGR2_CDPPRE2_DIV2
#define STM32_CDPPRE2_DIV4              RCC_CDCFGR2_CDPPRE2_DIV4
#define STM32_CDPPRE2_DIV8              RCC_CDCFGR2_CDPPRE2_DIV8
#define STM32_CDPPRE2_DIV16             RCC_CDCFGR2_CDPPRE2_DIV16

#define STM32_SRDPPRE_DIV1              (0U)
#define STM32_SRDPPRE_DIV2              RCC_SRDCFGR_SRDPPRE_DIV2
#define STM32_SRDPPRE_DIV4              RCC_SRDCFGR_SRDPPRE_DIV4
#define STM32_SRDPPRE_DIV8              RCC_SRDCFGR_SRDPPRE_DIV8
#define STM32_SRDPPRE_DIV16             RCC_SRDCFGR_SRDPPRE_DIV16

#define STM32_HSIDIV_DIV1               RCC_CR_HSIDIV_1
#define STM32_HSIDIV_DIV2               RCC_CR_HSIDIV_2
#define STM32_HSIDIV_DIV4               RCC_CR_HSIDIV_4
#define STM32_HSIDIV_DIV8               RCC_CR_HSIDIV_8

#define STM32_MCO1SEL_HSI_CK            RCC_CFGR_MCO1_VALUE(0U)
#define STM32_MCO1SEL_LSE_CK            RCC_CFGR_MCO1_VALUE(1U)
#define STM32_MCO1SEL_HSE_CK            RCC_CFGR_MCO1_VALUE(2U)
#define STM32_MCO1SEL_PLL1_Q_CK         RCC_CFGR_MCO1_VALUE(3U)
#define STM32_MCO1SEL_HSI48_CK          RCC_CFGR_MCO1_VALUE(4U)

#define STM32_MCO2SEL_SYS_CK            RCC_CFGR_MCO2_VALUE(0U)
#define STM32_MCO2SEL_PLL2_P_CK         RCC_CFGR_MCO2_VALUE(1U)
#define STM32_MCO2SEL_HSE_CK            RCC_CFGR_MCO2_VALUE(2U)
#define STM32_MCO2SEL_PLL1_P_CK         RCC_CFGR_MCO2_VALUE(3U)
#define STM32_MCO2SEL_CSI_CK            RCC_CFGR_MCO2_VALUE(4U)
#define STM32_MCO2SEL_LSI_CK            RCC_CFGR_MCO2_VALUE(5U)

#define STM32_RTCSEL_MASK               RCC_BDCR_RTCSEL_Msk
#define STM32_RTCSEL_NOCLK              RCC_BDCR_RTCSEL_VALUE(0U)
#define STM32_RTCSEL_LSE_CK             RCC_BDCR_RTCSEL_VALUE(1U)
#define STM32_RTCSEL_LSI_CK             RCC_BDCR_RTCSEL_VALUE(2U)
#define STM32_RTCSEL_HSE_1M_CK          RCC_BDCR_RTCSEL_VALUE(3U)

#define STM32_HRTIMSEL_C_CLK            RCC_CFGR_HRTIMSEL

#define STM32_STOPKERWUCK_ENABLED       RCC_CFGR_STOPKERWUCK

#define STM32_STOPWUCK_ENABLED          RCC_CFGR_STOPWUCK

#define STM32_PLLSRC_HSI_CK             RCC_PLLCKSELR_PLLSRC_VALUE(0U)
#define STM32_PLLSRC_CSI_CK             RCC_PLLCKSELR_PLLSRC_VALUE(1U)
#define STM32_PLLSRC_HSE_CK             RCC_PLLCKSELR_PLLSRC_VALUE(2U)
#define STM32_PLLSRC_DISABLE            RCC_PLLCKSELR_PLLSRC_VALUE(23U)

#define STM32_CKPERSEL_HSI_CK           RCC_CDCCIPR_CKPERSEL_VALUE(0U)
#define STM32_CKPERSEL_CSI_CK           RCC_CDCCIPR_CKPERSEL_VALUE(1U)
#define STM32_CKPERSEL_HSE_CK           RCC_CDCCIPR_CKPERSEL_VALUE(2U)

#define STM32_SDMMCSEL_PLL1_Q_CK        RCC_CDCCIPR_SDMMCSEL_VALUE(0U)
#define STM32_SDMMCSEL_PLL2_R_CK        RCC_CDCCIPR_SDMMCSEL_VALUE(1U)

#define STM32_OCTOSPISEL_HCLK           RCC_CDCCIPR_OCTOSPISEL_VALUE(0U)
#define STM32_OCTOSPISEL_PLL1_Q_CK      RCC_CDCCIPR_OCTOSPISEL_VALUE(1U)
#define STM32_OCTOSPISEL_PLL2_R_CK      RCC_CDCCIPR_OCTOSPISEL_VALUE(2U)
#define STM32_OCTOSPISEL_PER_CK         RCC_CDCCIPR_OCTOSPISEL_VALUE(3U)

#define STM32_FMCSEL_HCLK               RCC_CDCCIPR_FMCSEL_VALUE(0U)
#define STM32_FMCSEL_PLL1_Q_CK          RCC_CDCCIPR_FMCSEL_VALUE(1U)
#define STM32_FMCSEL_PLL2_R_CK          RCC_CDCCIPR_FMCSEL_VALUE(2U)
#define STM32_FMCSEL_PER_CK             RCC_CDCCIPR_FMCSEL_VALUE(3U)

#define STM32_SWPSEL_PCLK1              RCC_CDCCIP1R_SWPSEL_VALUE(0U)
#define STM32_SWPSEL_HSI_KER_CK         RCC_CDCCIP1R_SWPSEL_VALUE(1U)

#define STM32_FDCANSEL_HSE_CK           RCC_CDCCIP1R_FDCANSEL_VALUE(0U)
#define STM32_FDCANSEL_PLL1_Q_CK        RCC_CDCCIP1R_FDCANSEL_VALUE(1U)
#define STM32_FDCANSEL_PLL2_Q_CK        RCC_CDCCIP1R_FDCANSEL_VALUE(2U)

#define STM32_DFSDM1SEL_PCLK2           RCC_CDCCIP1R_DFSDM1SEL_VALUE(0U)
#define STM32_DFSDM1SEL_SYS_CK          RCC_CDCCIP1R_DFSDM1SEL_VALUE(1U)

#define STM32_DFSDM2SEL_PCLK4           RCC_CDCCIP1R_DFSDM2SEL_VALUE(0U)
#define STM32_DFSDM2SEL_SYS_CK          RCC_CDCCIP1R_DFSDM2SEL_VALUE(1U)

#define STM32_SPDIFSEL_PLL1_Q_CK        RCC_CDCCIP1R_SPDIFSEL_VALUE(0U)
#define STM32_SPDIFSEL_PLL2_R_CK        RCC_CDCCIP1R_SPDIFSEL_VALUE(1U)
#define STM32_SPDIFSEL_PLL3_R_CK        RCC_CDCCIP1R_SPDIFSEL_VALUE(2U)
#define STM32_SPDIFSEL_HSI_KET_CLK      RCC_CDCCIP1R_SPDIFSEL_VALUE(3U)

#define STM32_SPI45SEL_PCLK2            RCC_CDCCIP1R_SPI45SEL_VALUE(0U)
#define STM32_SPI45SEL_PLL2_Q_CK        RCC_CDCCIP1R_SPI45SEL_VALUE(1U)
#define STM32_SPI45SEL_PLL3_Q_CK        RCC_CDCCIP1R_SPI45SEL_VALUE(2U)
#define STM32_SPI45SEL_HSI_KER_CK       RCC_CDCCIP1R_SPI45SEL_VALUE(3U)
#define STM32_SPI45SEL_CSI_KER_CK       RCC_CDCCIP1R_SPI45SEL_VALUE(4U)
#define STM32_SPI45SEL_HSE_CK           RCC_CDCCIP1R_SPI45SEL_VALUE(5U)

#define STM32_SPI123SEL_PLL1_Q_CK       RCC_CDCCIP1R_SPI123SEL_VALUE(0U)
#define STM32_SPI123SEL_PLL2_P_CK       RCC_CDCCIP1R_SPI123SEL_VALUE(1U)
#define STM32_SPI123SEL_PLL3_P_CK       RCC_CDCCIP1R_SPI123SEL_VALUE(2U)
#define STM32_SPI123SEL_I2S_CKIN        RCC_CDCCIP1R_SPI123SEL_VALUE(3U)
#define STM32_SPI123SEL_PER_CK          RCC_CDCCIP1R_SPI123SEL_VALUE(4U)

#define STM32_SAI1SEL_PLL1_Q_CK         RCC_CDCCIP1R_SAI1SEL_VALUE(0U)
#define STM32_SAI1SEL_PLL2_P_CK         RCC_CDCCIP1R_SAI1SEL_VALUE(1U)
#define STM32_SAI1SEL_PLL3_P_CK         RCC_CDCCIP1R_SAI1SEL_VALUE(2U)
#define STM32_SAI1SEL_I2S_CKIN          RCC_CDCCIP1R_SAI1SEL_VALUE(3U)
#define STM32_SAI1SEL_PER_CK            RCC_CDCCIP1R_SAI1SEL_VALUE(4U)

#define STM32_LPTIM1SEL_PCLK1           RCC_CDCCIP2R_LPTIM1SEL_VALUE(0U)
#define STM32_LPTIM1SEL_PLL2_P_CK       RCC_CDCCIP2R_LPTIM1SEL_VALUE(1U)
#define STM32_LPTIM1SEL_PLL3_R_CK       RCC_CDCCIP2R_LPTIM1SEL_VALUE(2U)
#define STM32_LPTIM1SEL_LSE_CK          RCC_CDCCIP2R_LPTIM1SEL_VALUE(3U)
#define STM32_LPTIM1SEL_LSI_CK          RCC_CDCCIP2R_LPTIM1SEL_VALUE(4U)
#define STM32_LPTIM1SEL_PER_CK          RCC_CDCCIP2R_LPTIM1SEL_VALUE(5U)

#define STM32_CECSEL_LSE_CK             RCC_CDCCIP2R_CECSEL_VALUE(0U)
#define STM32_CECSEL_LSI_CK             RCC_CDCCIP2R_CECSEL_VALUE(1U)
#define STM32_CECSEL_CSI_KER_CK         RCC_CDCCIP2R_CECSEL_VALUE(2U)
#define STM32_CECSEL_DISABLE            RCC_CDCCIP2R_CECSEL_VALUE(3U)

#define STM32_USBSEL_DISABLE            RCC_CDCCIP2R_USBSEL_VALUE(0U)
#define STM32_USBSEL_PLL1_Q_CK          RCC_CDCCIP2R_USBSEL_VALUE(1U)
#define STM32_USBSEL_PLL3_Q_CK          RCC_CDCCIP2R_USBSEL_VALUE(2U)
#define STM32_USBSEL_HSI48_CK           RCC_CDCCIP2R_USBSEL_VALUE(3U)

#define STM32_I2C123SEL_PCLK1           RCC_CDCCIP2R_I2C123SEL_VALUE(0U)
#define STM32_I2C123SEL_PLL3_R_CK       RCC_CDCCIP2R_I2C123SEL_VALUE(1U)
#define STM32_I2C123SEL_HSI_KER_CK      RCC_CDCCIP2R_I2C123SEL_VALUE(2U)
#define STM32_I2C123SEL_CSI_KER_CK      RCC_CDCCIP2R_I2C123SEL_VALUE(3U)

