ArduPilot/ardupilot/modules/ChibiOS/os/hal/ports/STM32/STM32H7xx/hal_lld_type3.h
/*
 * Configuration-related checks.
 */
#if !defined(STM32H7xx_MCUCONF)
#error "Using a wrong mcuconf.h file, STM32H7xx_MCUCONF not defined"
#endif

#if defined(STM32H7A3xx) && !defined(STM32H7A3_MCUCONF)
#error "Using a wrong mcuconf.h file, STM32H7A3_MCUCONF not defined"
#endif

#if defined(STM32H7B3xx) && !defined(STM32H7B3_MCUCONF)
#error "Using a wrong mcuconf.h file, STM32H7B3_MCUCONF not defined"
#endif

#if defined(STM32H7A3xxQ) && !defined(STM32H7A3_Q_MCUCONF)
#error "Using a wrong mcuconf.h file, STM32H7A3_Q_MCUCONF not defined"
#endif

#if defined(STM32H7B3xxQ) && !defined(STM32H7B3_Q_MCUCONF)
#error "Using a wrong mcuconf.h file, STM32H7B3_Q_MCUCONF not defined"
#endif

/*
 * Board file checks.
 */
#if !defined(STM32_LSECLK)
#error "STM32_LSECLK not defined in board.h"
#endif
#if !defined(STM32_LSEDRV)
#error "STM32_LSEDRV not defined in board.h"
#endif
#if !defined(STM32_HSECLK)
#error "STM32_HSECLK not defined in board.h"
#endif

/**
 * @name    Constants depending on VOS setting
 * @{
 */
#if STM32_VOS == STM32_VOS_SCALE0
#define STM32_SDMMC_MAXCLK          280000000U
#define STM32_0WS_THRESHOLD         42000000U
#define STM32_1WS_THRESHOLD         84000000U
#define STM32_2WS_THRESHOLD         126000000U
#define STM32_3WS_THRESHOLD         168000000U
#define STM32_4WS_THRESHOLD         210000000U
#define STM32_5WS_THRESHOLD         256000000U
#define STM32_6WS_THRESHOLD         280000000U
#define STM32_PLLOUT_MAX            550000000U
#define STM32_PLLOUT_MIN            1500000U

#elif STM32_VOS == STM32_VOS_SCALE1
#define STM32_SDMMC_MAXCLK          225000000U
#define STM32_0WS_THRESHOLD         38000000U
#define STM32_1WS_THRESHOLD         76000000U
#define STM32_2WS_THRESHOLD         114000000U
#define STM32_3WS_THRESHOLD         152000000U
#define STM32_4WS_THRESHOLD         190000000U
#define STM32_5WS_THRESHOLD         225000000U
#define STM32_6WS_THRESHOLD         225000000U
#define STM32_PLLOUT_MAX            400000000U
#define STM32_PLLOUT_MIN            1500000U

#elif STM32_VOS == STM32_VOS_SCALE2
#define STM32_SDMMC_MAXCLK          160000000U
#define STM32_0WS_THRESHOLD         34000000U
#define STM32_1WS_THRESHOLD         68000000U
#define STM32_2WS_THRESHOLD         102000000U
#define STM32_3WS_THRESHOLD         136000000U
#define STM32_4WS_THRESHOLD         160000000U
#define STM32_5WS_THRESHOLD         160000000U
#define STM32_6WS_THRESHOLD         160000000U
#define STM32_PLLOUT_MAX            300000000U
#define STM32_PLLOUT_MIN            1500000U

#elif STM32_VOS == STM32_VOS_SCALE3
#define STM32_SDMMC_MAXCLK          88000000U
#define STM32_0WS_THRESHOLD         22000000U
#define STM32_1WS_THRESHOLD         44000000U
#define STM32_2WS_THRESHOLD         66000000U
#define STM32_3WS_THRESHOLD         88000000U
#define STM32_4WS_THRESHOLD         88000000U
#define STM32_5WS_THRESHOLD         88000000U
#define STM32_6WS_THRESHOLD         88000000U
#define STM32_PLLOUT_MAX            170000000U
#define STM32_PLLOUT_MIN            1500000U

#else
#error "invalid STM32_VOS setting specified"
#endif
/** @} */

/*
 * HSI related checks.
 */
#if STM32_HSI_ENABLED
#define STM32_HSICLK            STM32_HSI_OSC

#else /* !STM32_HSI_ENABLED */
#define STM32_HSICLK            0U

#if STM32_SW == STM32_SW_HSI_CK
#error "HSI not enabled, required by STM32_SW"
#endif

#if (STM32_PLLSRC == STM32_PLLSRC_HSI_CK) &&                                \
    (STM32_PLL1_ENABLED || STM32_PLL2_ENABLED || STM32_PLL3_ENABLED)
#error "HSI not enabled, required by STM32_PLLSRC and STM32_PLLx_ENABLED"
#endif

#if STM32_CKPERSEL == STM32_CKPERSEL_HSI_CK
#error "HSI not enabled, required by STM32_CKPERSEL"
#endif

#if STM32_MCO1SEL == STM32_MCO1SEL_HSI_CK
#error "HSI not enabled, required by STM32_MCO1SEL"
#endif

#endif /* !STM32_HSI_ENABLED */

/*
 * HSI48 related checks.
 */
#if STM32_HSI48_ENABLED
#define STM32_HSI48_CK          STM32_HSI48_OSC

#else /* !STM32_HSI48_ENABLED */
#define STM32_HSI48_CK          0U

#if STM32_MCO1SEL == STM32_MCO1SEL_HSI48_CK
#error "HSI48 not enabled, required by STM32_MCO1SEL"
#endif

#endif /* !STM32_HSI48_ENABLED */

/*
 * CSI related checks.
 */
#if STM32_CSI_ENABLED
#define STM32_CSI_CK            STM32_CSI_OSC

#else /* !STM32_CSI_ENABLED */
#define STM32_CSI_CK            0U

#if STM32_SW == STM32_SW_CSI_CK
#error "CSI not enabled, required by STM32_SW"
#endif

#if (STM32_PLLSRC == STM32_PLLSRC_CSI_CK) &&                                \
    (STM32_PLL1_ENABLED || STM32_PLL2_ENABLED || STM32_PLL3_ENABLED)
#error "CSI not enabled, required by STM32_PLLSRC and STM32_PLLx_ENABLED"
#endif

#if STM32_CKPERSEL == STM32_CKPERSEL_CSI_CK
#error "CSI not enabled, required by STM32_CKPERSEL"
#endif

#if STM32_MCO2SEL == STM32_MCO2SEL_CSI_CK
#error "CSI not enabled, required by STM32_MCO2SEL"
#endif

#endif /* !STM32_CSI_ENABLED */

/*
 * HSE related checks.
 */
#if STM32_HSE_ENABLED

#if !defined(STM32_HSECLK)
#error "HSE frequency not defined"
#endif

#define STM32_HSE_CK            STM32_HSECLK

#if STM32_HSECLK == 0
#error "HSE oscllator not available"
#else /* STM32_HSECLK != 0 */
#if defined(STM32_HSE_BYPASS)
#if (STM32_HSECLK < STM32_HSECLK_BYP_MIN) || (STM32_HSECLK > STM32_HSECLK_BYP_MAX)
#error "STM32_HSECLK outside acceptable range (STM32_HSECLK_BYP_MIN..STM32_HSECLK_BYP_MAX)"
#endif
#else /* !defined(STM32_HSE_BYPASS) */
#if (STM32_HSECLK < STM32_HSECLK_MIN) || (STM32_HSECLK > STM32_HSECLK_MAX)
#error "STM32_HSECLK outside acceptable range (STM32_HSECLK_MIN..STM32_HSECLK_MAX)"
#endif
#endif /* !defined(STM32_HSE_BYPASS) */
#endif /* STM32_HSECLK != 0 */
#else /* !STM32_HSE_ENABLED */

#if STM32_SW == STM32_SW_HSE_CK
#error "HSE not enabled, required by STM32_SW"
#endif

#if (STM32_PLLSRC == STM32_PLLSRC_HSE_CK) &&                                \
    (STM32_PLL1_ENABLED || STM32_PLL2_ENABLED || STM32_PLL3_ENABLED)
#error "HSE not enabled, required by STM32_PLLSRC and STM32_PLLx_ENABLED"
#endif

#if STM32_MCO1SEL == STM32_MCO1SEL_HSE_CK
#error "HSE not enabled, required by STM32_MCO1SEL"
#endif

#if STM32_MCO2SEL == STM32_MCO2SEL_HSE_CK
#error "HSE not enabled, required by STM32_MCO2SEL"
#endif

#if STM32_RTCSEL == STM32_RTCSEL_HSE_1M_CK
#error "HSE not enabled, required by STM32_RTCSEL"
#endif

#endif /* !STM32_HSE_ENABLED */

