ArduPilot/ardupilot/modules/ChibiOS/os/hal/ports/STM32/STM32H7xx/hal_lld_type3.h
/*
 * Check on the system clock.
 */
#if STM32_SYS_CK > STM32_SYSCLK_MAX
#error "STM32_SYS_CK above maximum rated frequency (STM32_SYSCLK_MAX)"
#endif

/**
 * @brief   Peripherals clock source.
 */
#if (STM32_CKPERSEL == STM32_CKPERSEL_HSI_CK) || defined(__DOXYGEN__)
#define STM32_PER_CK                STM32_HSI_CK

#elif (STM32_CKPERSEL == STM32_CKPERSEL_CSI_CK)
#define STM32_PER_CK                STM32_CSI_CK

#elif (STM32_CKPERSEL == STM32_CKPERSEL_HSE_CK)
#define STM32_PER_CK                STM32_HSE_CK

#else
#error "invalid STM32_CKPERSEL value specified"
#endif

/*
 * Check on the peripherals clock.
 */
#if STM32_PER_CK > STM32_HCLK_MAX
#error "STM32_PER_CK above maximum rated frequency (STM32_HCLK_MAX)"
#endif

/**
 * @brief   MCO1 divider clock.
 */
#if (STM32_MCO1SEL == STM32_MCO1SEL_HSI_CK) || defined(__DOXYGEN__)
#define STM32_MCO1DIVCLK            STM32_HSI_CK

#elif STM32_MCO1SEL == STM32_MCO1SEL_LSE_CK
#define STM32_MCO1DIVCLK            STM32_LSE_CK

#elif STM32_MCO1SEL == STM32_MCO1SEL_HSE_CK
#define STM32_MCO1DIVCLK            STM32_HSE_CK

#elif STM32_MCO1SEL == STM32_MCO1SEL_PLL1_Q_CK
#define STM32_MCO1DIVCLK            STM32_PLL1_P_CK

#elif STM32_MCO1SEL == STM32_MCO1SEL_HSI48_CK
#define STM32_MCO1DIVCLK            STM32_HSI48_CK

#else
#error "invalid STM32_MCO1SEL value specified"
#endif

/**
 * @brief   MCO1 output pin clock.
 */
#if (STM32_MCO1PRE_VALUE < 1) || (STM32_MCO1PRE_VALUE > 15)
#error "STM32_MCO1PRE_VALUE outside acceptable range (1..15)"
#endif

/**
 * @brief   MCO2 divider clock.
 */
#if (STM32_MCO2SEL == STM32_MCO2SEL_SYS_CK) || defined(__DOXYGEN__)
#define STM32_MCO2DIVCLK            STM32_SYS_CK

#elif STM32_MCO2SEL == STM32_MCO2SEL_PLL1_P_CK
#define STM32_MCO2DIVCLK            STM32_PLL2_P_CK

#elif STM32_MCO2SEL == STM32_MCO2SEL_HSE_CK
#define STM32_MCO2DIVCLK            STM32_HSE_CK

#elif STM32_MCO2SEL == STM32_MCO2SEL_PLL2_P_CK
#define STM32_MCO2DIVCLK            STM32_PLL2_P_CK

#elif STM32_MCO2SEL == STM32_MCO2SEL_CSI_CK
#define STM32_MCO2DIVCLK            STM32_CSI_CK

#elif STM32_MCO2SEL == STM32_MCO2SEL_LSI_CK
#define STM32_MCO2DIVCLK            STM32_LSI_CK

#else
#error "invalid STM32_MCO2SEL value specified"
#endif

/**
 * @brief   MCO2 output pin clock.
 */
#if (STM32_MCO2PRE_VALUE < 1) || (STM32_MCO2PRE_VALUE > 15)
#error "STM32_MCO2PRE_VALUE outside acceptable range (1..15)"
#endif

/**
 * @brief   RTC clock.
 */
#if (STM32_RTCSEL == STM32_RTCSEL_NOCLK) || defined(__DOXYGEN__)
#define STM32_RTC_CK                0

#elif STM32_RTCSEL == STM32_RTCSEL_LSE_CK
#define STM32_RTC_CK                STM32_LSE_CK

#elif STM32_RTCSEL == STM32_RTCSEL_LSI_CK
#define STM32_RTC_CK                STM32_LSI_CK

#elif STM32_RTCSEL == STM32_RTCSEL_HSE_1M_CK
#define STM32_RTC_CK                STM32_HSE_1M_CK

#else
#error "invalid STM32_RTCSEL value specified"
#endif

/*
 * Check on the RTC clock.
 */
#if STM32_RTC_CK > 1000000
#error "STM32_RTC_CK above maximum rated frequency (1000000)"
#endif

/**
 * @brief   CDCPRE clock.
 */
#if (STM32_CDCPRE == STM32_CDCPRE_DIV1) || defined(__DOXYGEN__)
#define STM32_SYS_CDCPRE_CK         (STM32_SYS_CK / 1U)
#elif STM32_CDCPRE == STM32_CDCPRE_DIV2
#define STM32_SYS_CDCPRE_CK         (STM32_SYS_CK / 2U)
#elif STM32_CDCPRE == STM32_CDCPRE_DIV4
#define STM32_SYS_CDCPRE_CK         (STM32_SYS_CK / 4U)
#elif STM32_CDCPRE == STM32_CDCPRE_DIV8
#define STM32_SYS_CDCPRE_CK         (STM32_SYS_CK / 8U)
#elif STM32_CDCPRE == STM32_CDCPRE_DIV16
#define STM32_SYS_CDCPRE_CK         (STM32_SYS_CK / 16U)
#elif STM32_CDCPRE == STM32_CDCPRE_DIV64
#define STM32_SYS_CDCPRE_CK         (STM32_SYS_CK / 64U)
#elif STM32_CDCPRE == STM32_CDCPRE_DIV128
#define STM32_SYS_CDCPRE_CK         (STM32_SYS_CK / 128U)
#elif STM32_CDCPRE == STM32_CDCPRE_DIV256
#define STM32_SYS_CDCPRE_CK         (STM32_SYS_CK / 256U)
#elif STM32_CDCPRE == STM32_CDCPRE_DIV512
#define STM32_SYS_CDCPRE_CK         (STM32_SYS_CK / 512U)
#else
#error "invalid STM32_CDCPRE value specified"
#endif

/**
 * @brief   HCLK clock.
 */
#if (STM32_CDHPRE == STM32_CDHPRE_DIV1) || defined(__DOXYGEN__)
#define STM32_HCLK                  (STM32_SYS_CDCPRE_CK / 1U)
#elif STM32_CDHPRE == STM32_CDHPRE_DIV2
#define STM32_HCLK                  (STM32_SYS_CDCPRE_CK / 2U)
#elif STM32_CDHPRE == STM32_CDHPRE_DIV4
#define STM32_HCLK                  (STM32_SYS_CDCPRE_CK / 4U)
#elif STM32_CDHPRE == STM32_CDHPRE_DIV8
#define STM32_HCLK                  (STM32_SYS_CDCPRE_CK / 8U)
#elif STM32_CDHPRE == STM32_CDHPRE_DIV16
#define STM32_HCLK                  (STM32_SYS_CDCPRE_CK / 16U)
#elif STM32_CDHPRE == STM32_CDHPRE_DIV64
#define STM32_HCLK                  (STM32_SYS_CDCPRE_CK / 64U)
#elif STM32_CDHPRE == STM32_CDHPRE_DIV128
#define STM32_HCLK                  (STM32_SYS_CDCPRE_CK / 128U)
#elif STM32_CDHPRE == STM32_CDHPRE_DIV256
#define STM32_HCLK                  (STM32_SYS_CDCPRE_CK / 256U)
#elif STM32_CDHPRE == STM32_CDHPRE_DIV512
#define STM32_HCLK                  (STM32_SYS_CDCPRE_CK / 512U)
#else
#error "invalid STM32_CDHPRE value specified"
#endif

/*
 * AHB frequency check.
 */
#if STM32_HCLK > STM32_HCLK_MAX
#error "STM32_HCLK exceeding maximum frequency (STM32_HCLK_MAX)"
#endif

/**
 * @brief   Core 1 clock.
 */
#define STM32_CORE1_CK              STM32_SYS_CDCPRE_CK

/**
 * @brief   Core 2 clock.
 */
#define STM32_CORE2_CK              0U

/**
 * @brief   Current core clock.
 */
#define STM32_CORE_CK               STM32_CORE1_CK

/**
 * @brief   CD PCLK clock.
 */
#if (STM32_CDPPRE == STM32_CDPPRE_DIV1) || defined(__DOXYGEN__)
#define STM32_CDPCLK                (STM32_HCLK / 1U)
#elif STM32_CDPPRE == STM32_CDPPRE_DIV2
#define STM32_CDPCLK                (STM32_HCLK / 2U)
#elif STM32_CDPPRE == STM32_CDPPRE_DIV4
#define STM32_CDPCLK                (STM32_HCLK / 4U)
#elif STM32_CDPPRE == STM32_CDPPRE_DIV8
#define STM32_CDPCLK                (STM32_HCLK / 8U)
#elif STM32_CDPPRE == STM32_CDPPRE_DIV16
#define STM32_CDPCLK                (STM32_HCLK / 16U)
#else
#error "invalid STM32_CDPPRE value specified"
#endif

