ArduPilot/ardupilot/modules/ChibiOS/os/hal/ports/STM32/STM32H7xx/hal_lld_type3.h
/*
 * D1 PCLK3 frequency check.
 */
#if 0
#if STM32_PCLK3 > STM32_PCLK3_MAX
#error "STM32_PCLK3 exceeding maximum frequency (STM32_PCLK3_MAX)"
#endif
#endif

/**
 * @brief   CD PCLK clock.
 */
#if (STM32_CDPPRE1 == STM32_CDPPRE1_DIV1) || defined(__DOXYGEN__)
#define STM32_PCLK1                 (STM32_HCLK / 1U)
#elif STM32_CDPPRE1 == STM32_CDPPRE1_DIV2
#define STM32_PCLK1                 (STM32_HCLK / 2U)
#elif STM32_CDPPRE1 == STM32_CDPPRE1_DIV4
#define STM32_PCLK1                 (STM32_HCLK / 4U)
#elif STM32_CDPPRE1 == STM32_CDPPRE1_DIV8
#define STM32_PCLK1                 (STM32_HCLK / 8U)
#elif STM32_CDPPRE1 == STM32_CDPPRE1_DIV16
#define STM32_PCLK1                 (STM32_HCLK / 16U)
#else
#error "invalid STM32_CDPPRE1 value specified"
#endif

/*
 * @brief   CD PCLK1 frequency check.
 */
#if STM32_PCLK1 > STM32_PCLK1_MAX
#error "STM32_PCLK1 exceeding maximum frequency (STM32_PCLK1_MAX)"
#endif

/**
 * @brief   CD PCLK2 clock.
 */
#if (STM32_CDPPRE2 == STM32_CDPPRE2_DIV1) || defined(__DOXYGEN__)
#define STM32_PCLK2                 (STM32_HCLK / 1U)
#elif STM32_CDPPRE2 == STM32_CDPPRE2_DIV2
#define STM32_PCLK2                 (STM32_HCLK / 2U)
#elif STM32_CDPPRE2 == STM32_CDPPRE2_DIV4
#define STM32_PCLK2                 (STM32_HCLK / 4U)
#elif STM32_CDPPRE2 == STM32_CDPPRE2_DIV8
#define STM32_PCLK2                 (STM32_HCLK / 8U)
#elif STM32_CDPPRE2 == STM32_CDPPRE2_DIV16
#define STM32_PCLK2                 (STM32_HCLK / 16U)
#else
#error "invalid STM32_CDPPRE2 value specified"
#endif

/*
 * @brief   CD PCLK2 frequency check.
 */
#if STM32_PCLK2 > STM32_PCLK2_MAX
#error "STM32_PCLK2 exceeding maximum frequency (STM32_PCLK2_MAX)"
#endif

/**
 * @brief   SRD PCLK clock.
 */
#if (STM32_SRDPPRE == STM32_SRDPPRE_DIV1) || defined(__DOXYGEN__)
#define STM32_SRDPCLK               (STM32_HCLK / 1U)
#elif STM32_SRDPPRE == STM32_SRDPPRE_DIV2
#define STM32_SRDPCLK               (STM32_HCLK / 2U)
#elif STM32_SRDPPRE == STM32_SRDPPRE_DIV4
#define STM32_SRDPCLK               (STM32_HCLK / 4U)
#elif STM32_SRDPPRE == STM32_SRDPPRE_DIV8
#define STM32_SRDPCLK               (STM32_HCLK / 8U)
#elif STM32_SRDPPRE == STM32_SRDPPRE_DIV16
#define STM32_SRDPCLK               (STM32_HCLK / 16U)
#else
#error "invalid STM32_SRDPPRE value specified"
#endif

/*
 * SRD PCLK frequency check.
 */
#if STM32_SRDPCLK > STM32_SRDPCLK_MAX
#error "STM32_SRDPCLK exceeding maximum frequency (STM32_SRDPCLK_MAX)"
#endif

/**
 * @brief   Flash settings.
 */
#if (STM32_HCLK <= STM32_0WS_THRESHOLD) || defined(__DOXYGEN__)
#define STM32_FLASHBITS             FLASH_ACR_LATENCY_0WS

#elif STM32_HCLK <= STM32_1WS_THRESHOLD
#define STM32_FLASHBITS             FLASH_ACR_LATENCY_1WS

#elif STM32_HCLK <= STM32_2WS_THRESHOLD
#define STM32_FLASHBITS             FLASH_ACR_LATENCY_2WS

#elif STM32_HCLK <= STM32_3WS_THRESHOLD
#define STM32_FLASHBITS             FLASH_ACR_LATENCY_3WS

#elif STM32_HCLK <= STM32_4WS_THRESHOLD
#define STM32_FLASHBITS             FLASH_ACR_LATENCY_4WS

#elif STM32_HCLK <= STM32_5WS_THRESHOLD
#define STM32_FLASHBITS             FLASH_ACR_LATENCY_5WS

#elif STM32_HCLK <= STM32_6WS_THRESHOLD
#define STM32_FLASHBITS             FLASH_ACR_LATENCY_6WS

#else
#define STM32_FLASHBITS             FLASH_ACR_LATENCY_7WS
#endif

#if (STM32_CDPPRE1 == STM32_CDPPRE1_DIV1) || defined(__DOXYGEN__)
/**
 * @brief   Clock of timers connected to APB1
 */
#define STM32_TIMCLK1               (STM32_PCLK1 * 1)
#else
#if (STM32_TIMPRE_ENABLE == FALSE) || (STM32_CDPPRE1 == STM32_CDPPRE1_DIV2)
#define STM32_TIMCLK1               (STM32_PCLK1 * 2)
#else
#define STM32_TIMCLK1               (STM32_PCLK1 * 4)
#endif
#endif

#if (STM32_CDPPRE2 == STM32_CDPPRE2_DIV1) || defined(__DOXYGEN__)
/**
 * @brief   Clock of timers connected to APB2.
 */
#define STM32_TIMCLK2               (STM32_PCLK2 * 1)
#else
#if (STM32_TIMPRE_ENABLE == FALSE) || (STM32_CDPPRE2 == STM32_CDPPRE2_DIV2)
#define STM32_TIMCLK2               (STM32_PCLK2 * 2)
#else
#define STM32_TIMCLK2               (STM32_PCLK2 * 4)
#endif
#endif

#if (STM32_LPTIM1SEL == STM32_LPTIM1SEL_PCLK1) || defined(__DOXYGEN__)
/**
 * @brief   LPTIM1 clock.
 */
#define STM32_LPTIM1CLK             STM32_PCLK1

#elif STM32_LPTIM1SEL == STM32_LPTIM1SEL_PLL2_P_CK
#define STM32_LPTIM1CLK             STM32_PLL2_P_CK
#elif STM32_LPTIM1SEL == STM32_LPTIM1SEL_PLL3_R_CK
#define STM32_LPTIM1CLK             STM32_PLL3_R_CK
#elif STM32_LPTIM1SEL == STM32_LPTIM1SEL_LSE_CK
#define STM32_LPTIM1CLK             STM32_LSE_CK
#elif STM32_LPTIM1SEL == STM32_LPTIM1SEL_LSI_CK
#define STM32_LPTIM1CLK             STM32_LSI_CK
#elif STM32_LPTIM1SEL == STM32_LPTIM1SEL_PER_CK
#define STM32_LPTIM1CLK             STM32_PER_CK
#else
#error "invalid source selected for STM32_LPTIM1SEL clock"
#endif

#if (STM32_LPTIM2SEL == STM32_LPTIM2SEL_PCLK4) || defined(__DOXYGEN__)
/**
 * @brief   LPTIM2 clock.
 */
#define STM32_LPTIM2CLK             STM32_PCLK4

#elif STM32_LPTIM2SEL == STM32_LPTIM2SEL_PLL2_P_CK
#define STM32_LPTIM2CLK             STM32_PLL2_P_CK
#elif STM32_LPTIM2SEL == STM32_LPTIM2SEL_PLL3_P_CK
#define STM32_LPTIM2CLK             STM32_PLL3_P_CK
#elif STM32_LPTIM2SEL == STM32_LPTIM2SEL_LSE_CK
#define STM32_LPTIM2CLK             STM32_LSE_CK
#elif STM32_LPTIM2SEL == STM32_LPTIM2SEL_LSI_CK
#define STM32_LPTIM2CLK             STM32_LSI_CK
#elif STM32_LPTIM2SEL == STM32_LPTIM2SEL_PER_CK
#define STM32_LPTIM2CLK             STM32_PER_CK
#else
#error "invalid source selected for STM32_LPTIM2SEL clock"
#endif

#if (STM32_LPTIM3SEL == STM32_LPTIM3SEL_PCLK4) || defined(__DOXYGEN__)
/**
 * @brief   LPTIM3 clock.
 */
#define STM32_LPTIM3CLK             STM32_PCLK4

/**
 * @brief   LPTIM4 clock.
 */
#define STM32_LPTIM4CLK             STM32_PCLK4

/**
 * @brief   LPTIM5 clock.
 */
#define STM32_LPTIM5CLK             STM32_PCLK4

#elif STM32_LPTIM3SEL == STM32_LPTIM3SEL_PLL2_P_CK
#define STM32_LPTIM3CLK             STM32_PLL2_P_CK
#define STM32_LPTIM4CLK             STM32_PLL2_P_CK
#define STM32_LPTIM5CLK             STM32_PLL2_P_CK
#elif STM32_LPTIM3SEL == STM32_LPTIM3SEL_PLL3_P_CK
#define STM32_LPTIM3CLK             STM32_PLL3_P_CK
#define STM32_LPTIM4CLK             STM32_PLL3_P_CK
#define STM32_LPTIM5CLK             STM32_PLL3_P_CK
#elif STM32_LPTIM3SEL == STM32_LPTIM3SEL_LSE_CK
#define STM32_LPTIM3CLK             STM32_LSE_CK
#define STM32_LPTIM4CLK             STM32_LSE_CK
#define STM32_LPTIM5CLK             STM32_LSE_CK
#elif STM32_LPTIM3SEL == STM32_LPTIM3SEL_LSI_CK
#define STM32_LPTIM3CLK             STM32_LSI_CK
#define STM32_LPTIM4CLK             STM32_LSI_CK
#define STM32_LPTIM5CLK             STM32_LSI_CK
#elif STM32_LPTIM3SEL == STM32_LPTIM3SEL_PER_CK
#define STM32_LPTIM3CLK             STM32_PER_CK
#define STM32_LPTIM4CLK             STM32_PER_CK
#define STM32_LPTIM5CLK             STM32_PER_CK
#else
#error "invalid source selected for STM32_LPTIM345SEL clock"
#endif

#if (STM32_USART16910SEL == STM32_USART16910SEL_PCLK2) || defined(__DOXYGEN__)
/**
 * @brief   USART1 clock.
 */
#define STM32_USART1CLK             STM32_PCLK2

/**
 * @brief   USART6 clock.
 */
#define STM32_USART6CLK             STM32_PCLK2

/**
 * @brief   UART9 clock.
 */
#define STM32_UART9CLK              STM32_PCLK2

/**
 * @brief   USART10 clock.
 */
#define STM32_USART10CLK            STM32_PCLK2

#elif STM32_USART16910SEL == STM32_USART16910SEL_PLL2_Q_CK
#define STM32_USART1CLK             STM32_PLL2_Q_CK
#define STM32_USART6CLK             STM32_PLL2_Q_CK
#define STM32_UART9CLK              STM32_PLL2_Q_CK
#define STM32_USART10CLK            STM32_PLL2_Q_CK
#elif STM32_USART16910SEL == STM32_USART16910SEL_PLL3_Q_CK
#define STM32_USART1CLK             STM32_PLL3_Q_CK
#define STM32_USART6CLK             STM32_PLL3_Q_CK
#define STM32_UART9CLK              STM32_PLL3_Q_CK
#define STM32_USART10CLK            STM32_PLL3_Q_CK
#elif STM32_USART16910SEL == STM32_USART16910SEL_HSI_KER_CK
#define STM32_USART1CLK             STM32_HSI_CK
#define STM32_USART6CLK             STM32_HSI_CK
#define STM32_UART9CLK              STM32_HSI_CK
#define STM32_USART10CLK            STM32_HSI_CK
#elif STM32_USART16910SEL == STM32_USART16910SEL_CSI_KER_CK
#define STM32_USART1CLK             STM32_CSI_CK
#define STM32_USART6CLK             STM32_CSI_CK
#define STM32_UART9CLK              STM32_CSI_CK
#define STM32_USART10CLK            STM32_CSI_CK
#elif STM32_USART16910SEL == STM32_USART16910SEL_LSE_CK
#define STM32_USART1CLK             STM32_LSE_CK
#define STM32_USART6CLK             STM32_LSE_CK
#define STM32_UART9CLK              STM32_LSE_CK
#define STM32_USART10CLK            STM32_LSE_CK
#else
#error "invalid source selected for STM32_USART16910SEL clock"
#endif

#if (STM32_USART234578SEL == STM32_USART234578SEL_PCLK1) || defined(__DOXYGEN__)
/**
 * @brief   USART2 clock.
 */
#define STM32_USART2CLK             STM32_PCLK1

/**
 * @brief   USART3 clock.
 */
#define STM32_USART3CLK             STM32_PCLK1

/**
 * @brief   USART4 clock.
 */
#define STM32_UART4CLK              STM32_PCLK1

/**
 * @brief   USART5 clock.
 */
#define STM32_UART5CLK              STM32_PCLK1

/**
 * @brief   USART7 clock.
 */
#define STM32_UART7CLK              STM32_PCLK1

/**
 * @brief   USART8 clock.
 */
#define STM32_UART8CLK              STM32_PCLK1

#elif STM32_USART234578SEL == STM32_USART234578SEL_PLL2_Q_CK
#define STM32_USART2CLK             STM32_PLL2_Q_CK
#define STM32_USART3CLK             STM32_PLL2_Q_CK
#define STM32_UART4CLK              STM32_PLL2_Q_CK
#define STM32_UART5CLK              STM32_PLL2_Q_CK
#define STM32_UART7CLK              STM32_PLL2_Q_CK
#define STM32_UART8CLK              STM32_PLL2_Q_CK
#elif STM32_USART234578SEL == STM32_USART234578SEL_PLL3_Q_CK
#define STM32_USART2CLK             STM32_PLL3_Q_CK
#define STM32_USART3CLK             STM32_PLL3_Q_CK
#define STM32_UART4CLK              STM32_PLL3_Q_CK
#define STM32_UART5CLK              STM32_PLL3_Q_CK
#define STM32_UART7CLK              STM32_PLL3_Q_CK
#define STM32_UART8CLK              STM32_PLL3_Q_CK
#elif STM32_USART234578SEL == STM32_USART234578SEL_HSI_KER_CK
#define STM32_USART2CLK             STM32_HSI_CK
#define STM32_USART3CLK             STM32_HSI_CK
#define STM32_UART4CLK              STM32_HSI_CK
#define STM32_UART5CLK              STM32_HSI_CK
#define STM32_UART7CLK              STM32_HSI_CK
#define STM32_UART8CLK              STM32_HSI_CK
#elif STM32_USART234578SEL == STM32_USART234578SEL_CSI_KER_CK
#define STM32_USART2CLK             STM32_CSI_CK
#define STM32_USART3CLK             STM32_CSI_CK
#define STM32_UART4CLK              STM32_CSI_CK
#define STM32_UART5CLK              STM32_CSI_CK
#define STM32_UART7CLK              STM32_CSI_CK
#define STM32_UART8CLK              STM32_CSI_CK
#elif STM32_USART234578SEL == STM32_USART234578SEL_LSE_CK
#define STM32_USART2CLK             STM32_LSE_CK
#define STM32_USART3CLK             STM32_LSE_CK
#define STM32_UART4CLK              STM32_LSE_CK
#define STM32_UART6CLK              STM32_LSE_CK
#define STM32_UART7CLK              STM32_LSE_CK
#define STM32_UART8CLK              STM32_LSE_CK
#else
#error "invalid source selected for STM32_USART234578SEL clock"
#endif

#if (STM32_LPUART1SEL == STM32_LPUART1SEL_PCLK4) || defined(__DOXYGEN__)
/**
 * @brief   LPUART1 clock.
 */
#define STM32_LPUART1CLK            STM32_PCLK4

#elif STM32_LPUART1SEL == STM32_LPUART1SEL_PLL2_Q_CK
#define STM32_LPUART1CLK            STM32_PLL2_Q_CK
#elif STM32_LPUART1SEL == STM32_LPUART1SEL_PLL3_Q_CK
#define STM32_LPUART1CLK            STM32_PLL3_Q_CK
#elif STM32_LPUART1SEL == STM32_LPUART1SEL_HSI_KER_CK
#define STM32_LPUART1CLK            STM32_HSI_CK
#elif STM32_LPUART1SEL == STM32_LPUART1SEL_CSI_KER_CK
#define STM32_LPUART1CLK            STM32_CSI_CK
#elif STM32_LPUART1SEL == STM32_LPUART1SEL_LSE_CK
#define STM32_LPUART1CLK            STM32_LSE_CK
#else
#error "invalid source selected for STM32_LPUART1SEL clock"
#endif

